// Задача для джунов 
// 7. Показать числа от -N до N

int N = 6; 

int index = -N; 

while (index <= N)
{
  Console.WriteLine(index);
  index = index + 1;
}